# PyMySQL

In [12]:
import pymysql
import pandas as pd

## connect to MySQL database
`pymysql.connect(host='localhost', user='yourusername', password='yourpassword', database='yourdatabase')`

In [ ]:
# basic connection example
connection = pymysql.connect(
    host='localhost',
    user='root',
    password='Lion980601016101',
    database='test'
)
print("Connected to MySQL database")
connection.close()   # close the connection

Connected to MySQL database

In [3]:
# with try-except for error handling
try:
    connection = pymysql.connect(
        host='localhost',
        user='root',
        password='Lion980601016101',
        database='test'
    )
    print("Connected to MySQL database")
except pymysql.MySQLError as e:
    print(f"Error connecting to MySQL database: {e}")

connection.close()   # close the connection

Connected to MySQL database

In [4]:
# with context manager
with pymysql.connect(
    host='localhost',
    user='root',
    password='Lion980601016101',
    database='test'
) as connection:
    print("Connected to MySQL database")
# connection is automatically closed when exiting the block

Connected to MySQL database

In [21]:
# defining a function to connect and for further use
def run_mysql(db_name, command = None):
    try:
        connection = pymysql.connect(
            host='localhost',
            user='root',
            passwd='Lion980601016101',
            db=db_name
        )
        print(f"Connected to MySQL database: {db_name}")
        cursor = command(connection)
        connection.close()
        return cursor
        
    except pymysql.MySQLError as e:
        print(f"Error connecting to MySQL database: {e}")
        return None

## Execute MySQL Commands

In [20]:
# use connection.cursor().execute() to run SQL commands
# for example, use database 'test'
def use_db(connection):
    cursor = connection.cursor()
    cursor.execute("USE test;")
    print("Database 'test' is now in use")

run_mysql('test', use_db)

Connected to MySQL database: test
Database 'test' is now in use

## Recieve .execute() returns
- Use `cursor.fetchall()` to get all rows returned by the query.
- Use `cursor.fetchone()` to get the next row returned by the query.
- Use `cursor.rowcount` to get the number of rows affected by the last operation, used for check the number of rows effected by management statements, such as `INSERT`, `UPDATE`, or `DELETE` statements.
- Use `cursor.description` to get the column names and types of the last query. return a list of tuples, (`name`, `type_code`, `display_size`, `internal_size`, `precision`, `scale`, `null_ok`).

Description elements:  

|Element|Description|
|---|---|
|`name`|The name of the column.|
|`type_code`|The type code of the column.|
|`display_size`|The display size of the column.|
|`internal_size`|The internal size of the column.|
|`precision`|The precision of the column.|
|`scale`|The scale of the column.|
|`null_ok`|Indicates whether the column can contain NULL values.|

In [23]:
## .fatchall()
def query_db(connection):
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM emp;")
    return cursor

cursor = run_mysql('test', query_db)
result = cursor.fetchall()
print(result)

Connected to MySQL database: test
((1, '金庸', 66, '总裁', 20000, datetime.date(2000, 1, 1), None, 5), (2, '张无忌', 20, '项目经理', 0, datetime.date(2005, 12, 5), 1, 1), (3, '杨逍', 33, '开发', 8400, datetime.date(2000, 11, 3), 2, 1), (4, '韦一笑', 48, '开发', 11000, datetime.date(2002, 2, 5), 2, 1), (5, '常遇春', 43, '开发', 10500, datetime.date(2004, 9, 7), 3, 1), (6, '小昭', 19, '程序员鼓励师', 6600, datetime.date(2004, 10, 12), 2, 1), (7, '灭绝', 60, '财务总监', 8500, datetime.date(2002, 9, 12), 1, 3), (8, '周芷若', 19, '会计', 4800, datetime.date(2006, 6, 2), 7, 3), (9, '丁敏君', 23, '出纳', 5250, datetime.date(2009, 5, 12), 7, 3), (10, '赵敏', 20, '市场部总监', 12500, datetime.date(2002, 2, 5), 1, 2), (11, '鹿杖客', 56, '职员', 3750, datetime.date(2006, 12, 5), 10, 2), (12, '鹤笔翁', 19, '职员', 3750, datetime.date(2006, 5, 25), 10, 2), (13, '方东白', 19, '职员', 5500, datetime.date(2002, 11, 5), 10, 2), (14, '张三丰', 88, '销售总监', 14000, datetime.date(2003, 6, 15), 1, 4), (15, '俞莲舟', 38, '销售', 4600, datetime.date(2003, 7, 5), 14, 4), (16, '宋远桥', 40, '销售', 4600, datetime.date(2004, 9, 18), 14, 4), (17, '陈友谅', 42, None, 2000, datetime.date(2010, 6, 16), 1, None))

In [24]:
description = cursor.description
print(description)

(('id', 3, None, 11, 11, 0, False), ('name', 253, None, 200, 200, 0, False), ('age', 3, None, 11, 11, 0, True), ('job', 253, None, 80, 80, 0, True), ('salary', 3, None, 11, 11, 0, True), ('enterdate', 10, None, 10, 10, 0, True), ('managerid', 3, None, 11, 11, 0, True), ('dept_id', 3, None, 11, 11, 0, True))

In [25]:
# extract field names
field_names = [desc[0] for desc in description]
print(field_names)

['id', 'name', 'age', 'job', 'salary', 'enterdate', 'managerid', 'dept_id']

In [26]:
# combine results into a DataFrame
df = pd.DataFrame(result, columns=field_names)
df

    id name  age     job  salary   enterdate  managerid  dept_id
0    1   金庸   66      总裁   20000  2000-01-01        NaN      5.0
1    2  张无忌   20    项目经理       0  2005-12-05        1.0      1.0
2    3   杨逍   33      开发    8400  2000-11-03        2.0      1.0
3    4  韦一笑   48      开发   11000  2002-02-05        2.0      1.0
4    5  常遇春   43      开发   10500  2004-09-07        3.0      1.0
5    6   小昭   19  程序员鼓励师    6600  2004-10-12        2.0      1.0
6    7   灭绝   60    财务总监    8500  2002-09-12        1.0      3.0
7    8  周芷若   19      会计    4800  2006-06-02        7.0      3.0
8    9  丁敏君   23      出纳    5250  2009-05-12        7.0      3.0
9   10   赵敏   20   市场部总监   12500  2002-02-05        1.0      2.0
10  11  鹿杖客   56      职员    3750  2006-12-05       10.0      2.0
11  12  鹤笔翁   19      职员    3750  2006-05-25       10.0      2.0
12  13  方东白   19      职员    5500  2002-11-05       10.0      2.0
13  14  张三丰   88    销售总监   14000  2003-06-15        1.0      4.0
14  15  俞莲舟   38      销售    4600  2003-07-05       14.0      4.0
15  16  宋远桥   40      销售    4600  2004-09-18       14.0      4.0
16  17  陈友谅   42    None    2000  2010-06-16        1.0      NaN

In [29]:
def insert_data(connection):
    cursor = connection.cursor()
    cursor.execute("INSERT INTO emp (name, age,job,salary,enterdate) VALUES ('张三', 30,'职员',3000,'2022-07-19');")
    connection.commit()  # commit the changes
    print("Data inserted successfully")
    return cursor

cursor = run_mysql('test', insert_data)
print(cursor.rowcount, "record inserted.")

Connected to MySQL database: test
Data inserted successfully
1 record inserted.